[
    {
        "Course Number and Title": "402-0368-07L  \r\n       Lecture Series: Space Research and Exploration",
        "Lecturers": "S. P. Quanz",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Di",
        "Time": "12:15-14:00",
        "Where": "HG E 1.1 »",
        "Short Description": "Lecture Series about selected topics of space research and exploration consisting of individual talks given by different leading experts from academia and industry.",
        "ECTS Credits": "1 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "402-0035-00L  \r\n       Physik",
        "Lecturers": "L. Degiorgi",
        "Comment 1": "N/A",
        "Comment 2": "Die Vorlesung findet im HPH G 1 mit Videoüebtragung ins HPV G 5.",
        "Weekday": "Di",
        "Time": "14:45-17:30",
        "Where": "HPH G 1 »",
        "Short Description": "Einsemestrige Einführung in die Grundlagen und Denkweise der Physik: Elektrizität und Magnetismus, elektromagnetische Wellen, Wellen und Doppler Effekt. Vertiefung in ausgewählte Themen der modernen Physik von grosser technologischer oder industrieller Bedeutung.",
        "ECTS Credits": "5 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "401-0172-00L  \r\n       Lineare Algebra II",
        "Lecturers": "N. Hungerbühler",
        "Comment 1": "N/A",
        "Comment 2": "Do 14-16 im ETA F 5 mit Videoübertragung ins ETF E 1.",
        "Weekday": "Do",
        "Time": "14:15-16:00",
        "Where": "ETA F 5 »",
        "Short Description": "Die Vorlesung ist die Fortsetzung von Lineare Algebra I. Die Lineare Algebra ist ein unverzichtbares Werkzeug der Ingenieurmathematik. Die Vorlesung bietet einen Einstieg in die Theorie mit zahlreichen Anwendungen. Die erlernten Begriffe werden in den begleitenden Übungen gefestigt.",
        "ECTS Credits": "6 KP",
        "Restrictions": "Einschränkungen sind unter Gruppen aufgeführt"
    },
    {
        "Course Number and Title": "151-0714-00L  \r\n       Werkstoffe und Fertigung",
        "Lecturers": "M. Bambach, \r\n L. Deillon",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung Mo 12-14 im HG F 7 mit Videoübertragung ins HG F 5 und Fri 10-12 im ETA F 5.",
        "Weekday": "Mo",
        "Time": "12:15-14:00",
        "Where": "HG F 5 »",
        "Short Description": "Die Vorlesung \"Werkstoffe und Fertigung\" vermittelt den Studierenden die Grundlagen, um Werkstoffe für Anwendungen im Maschinenbau systematisch auszuwählen.",
        "ECTS Credits": "6 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0591-00L  \r\n       Control Systems I",
        "Lecturers": "E. Frazzoli",
        "Comment 1": "N/A",
        "Comment 2": "The Wednesday lectures are held in ML D 28 with video transmission to ML E 12.The course starts in the first week of the semester.",
        "Weekday": "Mi",
        "Time": "16:15-18:00",
        "Where": "ML D 28 »",
        "Short Description": "Analysis and synthesis for linear time-invariant control systems with one input and one output signal (SISO). State-space models, time response, stability conditions. Transfer functions and frequency response. Stability analysis under feedback: Root Locus, Bode plots, Nyquist condition. Feedback control synthesis: time- and frequency-domain specifications, PID lead/lag compensation, loop shaping.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0575-01L  \r\n       Signals and Systems",
        "Lecturers": "A. Carron",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Do",
        "Time": "14:15-16:00",
        "Where": "ETF C 1 »",
        "Short Description": "Signals arise in most engineering applications. They contain information about the behavior of physical systems. Systems respond to signals and produce other signals. In this course, we explore how signals can be represented and manipulated, and their effects on systems. We further explore how we can discover basic system properties by exciting a system with various types of signals.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0163-00L  \r\n       Nuclear Energy Conversion",
        "Lecturers": "A. Manera",
        "Comment 1": "N/A",
        "Comment 2": "The course starts in the second week.",
        "Weekday": "Mo",
        "Time": "14:15-16:00",
        "Where": "ML F 36 »",
        "Short Description": "Physikalische Grundlagen der Kernspaltung und der Kettenreaktion, thermische Auslegung, Aufbau, Funktion, und Betrieb von Kernreaktoren und Kernkraftwerken, Leichtwasserreaktoren und andere Reaktortypen, Konversion und Brüten",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0851-00L  \r\n       Robot Dynamics",
        "Lecturers": "M. Hutter, \r\n R. Siegwart",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Di",
        "Time": "10:15-12:00",
        "Where": "HG G 5 »",
        "Short Description": "We will provide an overview on how to kinematically and dynamically model typical robotic systems such as robot arms, legged robots, rotary wing systems, or fixed wing.",
        "ECTS Credits": "4 KP",
        "Restrictions": ": Für Fachstudierende und Hörer/-innen ist eine Spezialbewilligung der Dozierenden notwendig"
    },
    {
        "Course Number and Title": "151-0238-00L  \r\n       Thermodynamics III",
        "Lecturers": "A. Manera, \r\n G. Sansavini",
        "Comment 1": "N/A",
        "Comment 2": "Gruppeneinteilung erfolgt über myStudies.The exercise will start in the 2nd week of the Semester.                                                                                                                                                                                                                                                                          Zusätzlich wird das Study Center angeboten: Mittwochs 18:15-20:00 ab der 3. Semesterwoche im ETA F 5, wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Do",
        "Time": "12:15-14:00",
        "Where": "ETA F 5 »",
        "Short Description": "Introduction to the fundamentals of heat transfer and technical applications of engineering thermodynamics. Extension of thermodynamic fundamentals taught in Thermodynamics I and II.",
        "ECTS Credits": "3 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0120-00L  \r\n       Fluid Dynamics",
        "Lecturers": "F. Coletti, \r\n P. Jenny",
        "Comment 1": "The course (both lecture and exercise) consists of two parts: part 1 will be in English and part 2 in German.",
        "Comment 2": "Vorlesung Mo 14-16 im ETA F 5, Di 12-14  im ETA F 5 und Mi 12-14 im HG E 7 mit Videoübertragung ins HG E 3.",
        "Weekday": "Mo",
        "Time": "14:15-16:00",
        "Where": "ETA F 5 »",
        "Short Description": "An introduction to the physical and mathematical foundations of fluid dynamics is given. Topics include dimensional analysis, integral and differential conservation laws, inviscid and viscous flows, Navier-Stokes equations, boundary layers, turbulence, potential flows, unsteady flows, aerodynamic concepts, vorticity dynamics, compressible flows.",
        "ECTS Credits": "8 KP",
        "Restrictions": "Einschränkungen sind unter Gruppen aufgeführt"
    },
    {
        "Course Number and Title": "151-0533-00L  \r\n       Introduction to Computing",
        "Lecturers": "L. De Lorenzis",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Mi",
        "Time": "10:15-12:00",
        "Where": "HG E 7 »",
        "Short Description": "The course provides a broad introduction to modern techniques in scientific computing, useful for tasks ranging from data analysis to engineering computations. For each topic, a solid theoretical foundation is combined with extensive exposure to practical examples and coding exercises.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "401-0363-10L  \r\n       Analysis III",
        "Lecturers": "A. Iozzi",
        "Comment 1": "N/A",
        "Comment 2": "Lectures in HG F7 with video transmission to HG F5.",
        "Weekday": "Do",
        "Time": "14:15-16:00",
        "Where": "HG F 5 »",
        "Short Description": "Introduction to partial differential equations. Differential equations which are important in applications are classified and solved. Elliptic, parabolic and hyperbolic differential equations are treated. The following mathematical tools are introduced: Laplace transforms, Fourier series, separation of variables, methods of characteristics.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0052-00L  \r\n       Thermodynamics II",
        "Lecturers": "R. S. Abhari, \r\n N. Noiray",
        "Comment 1": "N/A",
        "Comment 2": "Unterricht im HG F 7 mit Videoübertragung ins HG F 5.",
        "Weekday": "Di",
        "Time": "08:15-10:00",
        "Where": "HG F 5 »",
        "Short Description": "Introduction to thermodynamics of cycles as well as reactive systems",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "252-0833-00L  \r\n       Informatik II",
        "Lecturers": "C. Cotrini Jimenez, \r\n R. Sasse",
        "Comment 1": "Nur für Maschineningenieurwissenschaften BSc (Studienreglement 2022).",
        "Comment 2": "Zusätzlich wird das Study Center angeboten: Donnerstags 18-20 ab der 3. Semesterwoche im HG F1, wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Do",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "Informatik II legt die Grundlage für das Verständnis, den Entwurf und die Analyse von Algorithmen und Datenstrukturen.Zudem gibt es einen Überblick von verschiedenen Programmierkonzepten, wie funktionale Programmierung und statische und dynamisch typisierte Programmiersprachen.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0300-10L  \r\n       Innovationsprojekt",
        "Lecturers": "M. Meboldt",
        "Comment 1": "N/A",
        "Comment 2": "Einführungsveranstaltung für Innovationsprojekt am Di 19.09.2023 von 09:15  bis 10:00 Uhr im ETA F 5.Die Gruppeneinteilung, der Zeitplan und weitere organisatorische Informationen werden während der Infoveranstaltung in der 1. Semesterwoche bekannt gegeben; Projektarbeit, Werkstattzeit im LEO B 8.1, Online Material und Fragestunden. Details dazu werden im Semester auf Moodle kommuniziert.Die Übungen beginnen in der zweiten Semesterwoche.",
        "Weekday": "Di",
        "Time": "14:15-18:00",
        "Where": "GLC E 24 »",
        "Short Description": "Die Studierenden durchlaufen einen Produktentwicklungsprozess von der ersten Idee bis zum funktionsfähigen Produkt. Die Teilnehmer lernen eine komplexe Entwicklungsaufgabe im Team (5 Pers.) zu bearbeiten, eine gegebene Problemstellung zu strukturieren und Ideen zu generieren und zu bewerten sowie das Entwerfen und Realisieren des Produktes mit anschliessender Verifikation.",
        "ECTS Credits": "3 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "401-0262-00L  \r\n       Analysis II",
        "Lecturers": "A. Steiger",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung im ETA F 5 mit Videoübertragung ins ETF E 1",
        "Weekday": "Mo/2w",
        "Time": "12:15-14:00",
        "Where": "ETA F 5 »",
        "Short Description": "Einführung in die mathematischen Grundlagen der Ingenieurwissenschaften, soweit sie die Differential- und Integralrechnung betreffen.",
        "ECTS Credits": "7 KP",
        "Restrictions": "Einschränkungen sind unter Gruppen aufgeführt"
    },
    {
        "Course Number and Title": "151-0662-00L  \r\n       Programming for Robotics - Introduction to ROS",
        "Lecturers": "M. Hutter",
        "Comment 1": "This course targets senior Bachelor students as well as Master students focusing on Robotics, Systems, and Control. Priority is given to people conducting a project work in the field.",
        "Comment 2": "Block course during the first two weeks of the semester.",
        "Weekday": "17.02.",
        "Time": "08:15-12:00",
        "Where": "HG D 1.2 »",
        "Short Description": "This course gives an introduction to the Robot Operating System (ROS) including many of the available tools that are commonly used in robotics. With the help of different examples, the course should provide a good starting point for students to work with robots. They learn how to create software including simulation, to interface sensors and actuators, and to integrate control algorithms.",
        "ECTS Credits": "1 KP",
        "Restrictions": "Maximal 70"
    },
    {
        "Course Number and Title": "853-0061-00L  \r\n       Einführung in die Cybersicherheitspolitik",
        "Lecturers": "M. Dunn Cavelty, \r\n F. J. Egloff",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Mo",
        "Time": "10:15-12:00",
        "Where": "HG D 7.2 »",
        "Short Description": "Die Vorlesung gibt eine Einführung in die globale Politik der Cyber-Sicherheit. Im Zentrum steht die Auseinandersetzung mit der strategischen Nutzung des Cyberraums durch staatliche und nichtstaatliche Akteure (Bedrohungen) und unterschiedliche Antworten auf diese neuen Herausforderungen (Gegenmassnahmen).",
        "ECTS Credits": "3 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0051-00L  \r\n       Thermodynamik I",
        "Lecturers": "A. Bardow, \r\n C. Müller",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung im ML D 28 mit Videoübertragung ins ML E 12.",
        "Weekday": "Do",
        "Time": "10:15-12:00",
        "Where": "ML D 28 »",
        "Short Description": "Einführung in die Theorie und in die Grundlagen der technischen Thermodynamik.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0966-00L  \r\n       Quantum Mechanics",
        "Lecturers": "D. J. Norris",
        "Comment 1": "Note: The previous course title until FS23 \"Introduction to Quantum Mechanics for Engineers\"",
        "Comment 2": "Vorlesung im HG E 7 mit Videoübertragung ins HG E 3.",
        "Weekday": "Mi",
        "Time": "14:15-16:00",
        "Where": "HG E 3 »",
        "Short Description": "This course provides fundamental knowledge in the principles of quantum mechanics and connects it to applications in engineering.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0001-20L  \r\n       Bachelor-Arbeit",
        "Lecturers": "Betreuer/innen",
        "Comment 1": "Nur für Maschineningenieurwissenschaften BSc, Studienreglement 2022.Nur für Studierende mit Fokus-Vertiefung. Betreuer der Bachelor-Arbeit:  Die Betreuerin oder der Betreuer der Bachelor-Arbeit ist ein/e Professor/in des D-MAVT oder eines anderen Departements der Ingenieurwissenschaften. Für die Anmeldung der Bachelor-Arbeiten unter der Betreuung von Professorinnen oder Professoren anderer ingenieurwissenschaftlicher Departemente, die nicht in der Auswahl-Liste aufgeführt sind, wenden Sie sich bitte an die Studienadministration: info@mavt.ethz.ch",
        "Comment 2": "N/A",
        "Weekday": "N/A",
        "Time": "N/A",
        "Where": "N/A",
        "Short Description": "Die Bachelor-Arbeit wird als Abschluss im 6. Semester durchgeführt. Sie entspricht einem Umfang von 480 Stunden und kann in Teil- oder Vollzeit durchgeführt werden.",
        "ECTS Credits": "16 KP",
        "Restrictions": ": Für Fachstudierende und Hörer/-innen ist eine Spezialbewilligung der Dozierenden notwendig"
    },
    {
        "Course Number and Title": "151-0833-00L  \r\n       Applied Finite Element Analysis",
        "Lecturers": "B. Berisha, \r\n D. Mohr",
        "Comment 1": "N/A",
        "Comment 2": "The exercises will start in the 2nd week of the Semester.",
        "Weekday": "Mi",
        "Time": "10:15-12:00",
        "Where": "IFW A 36 »",
        "Short Description": "Die meisten Problemstellungen im Ingenieurwesen sind nichtlinearer Natur. Die Nichtlinearitäten werden hauptsächlich durch nichtlineares Werkstoffverhalten, Kontaktbedingungen und Strukturinstabilitäten hervorgerufen. Im Rahmen dieser Vorlesung  werden die theoretischen Grundlagen der nichtlinearen Finite-Element-Methoden zur Lösung von solchen Problemstellungen vermittelt.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0321-00L  \r\n       Engineering Design and Material Selection",
        "Lecturers": "K. Shea",
        "Comment 1": "N/A",
        "Comment 2": "Gruppeneinteilung erfolgt über myStudies.Vorlesung Mo 15-16 im HG E7 mit Videoübertragung ins HG E5Die Lehrveranstaltung (Vorlesung und Übung) beginnt in der 2. Semesterwoche.",
        "Weekday": "Mo",
        "Time": "15:15-16:00",
        "Where": "HG E 5 »",
        "Short Description": "This course provides an introduction to engineering design. Through hands-on, practice-oriented exercises, students experience the fundamentals of design concept generation and selecting materials. They create 3D models in CAD for their own customized design and fabricate them using 3D printing. Three case studies in healthcare, mobility and sustainable materials will be explored.",
        "ECTS Credits": "4 KP",
        "Restrictions": ": Für Fachstudierende und Hörer/-innen ist eine Spezialbewilligung der Dozierenden notwendig"
    },
    {
        "Course Number and Title": "151-0909-00L  \r\n       Chemistry",
        "Lecturers": "D. J. Norris",
        "Comment 1": "N/A",
        "Comment 2": "Donnerstags 18-20 ab der 3. Semesterwoche im HG F 7 wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Do",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "This is a general chemistry course aimed at first-year bachelor students in the Department of Mechanical and Process Engineering.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0306-00L  \r\n       Visualization, Simulation and Interaction - Virtual Reality I",
        "Lecturers": "A. Kunz",
        "Comment 1": "N/A",
        "Comment 2": "Start in the second week of the Semester.",
        "Weekday": "Do",
        "Time": "14:15-18:00",
        "Where": "ML H 44 »",
        "Short Description": "Technologie der virtuellen Realität. Menschliche Faktoren, Erzeugung virtueller Welten, Beleuchtungsmodelle, Display- und Beschallungssysteme, Tracking, haptische/taktile Interaktion, Motion Platforms, virtuelle Prototypen, Datenaustausch, VR-Komplettsysteme, Augmented Reality; Kollaborationssysteme; VR und Design; Umsetzung der VR in der Industrie; Human COmputer Interfaces (HCI).",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "851-0252-10L  \r\n       Project in Behavioural Finance",
        "Lecturers": "S. Andraszewicz, \r\n C. Hölscher, \r\n A. C. Roberts",
        "Comment 1": "Besonders geeignet für Studierende D-MTEC.",
        "Comment 2": "The lecturers will communicate the exact lesson times of ONLINE courses.",
        "Weekday": "Mi",
        "Time": "10:00-12:00",
        "Where": "ON LI NE »",
        "Short Description": "In this seminar, students will study cognitive processes, behaviour and the underlying biological response to financial decisions. Research methods such as asset market experiments, lottery games, risk preference assessment, psychometrics, neuroimaging and psychophysiology of decision processes will be discussed. Financial bubbles and crashes will be the core interest.",
        "ECTS Credits": "3 KP",
        "Restrictions": "Maximal 40"
    },
    {
        "Course Number and Title": "151-0534-00L  \r\n       Advanced Dynamics",
        "Lecturers": "P. Tiso",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Di",
        "Time": "10:15-12:00",
        "Where": "CAB G 11 »",
        "Short Description": "Lagrangian dynamics - Principle of virtual work and virtual power - holonomic and non holonomic contraints - 3D rigid body dynamics  - equilibrium - linearization - stability - vibrations - frequency response",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "851-0371-00L  \r\n       Coaching Students",
        "Lecturers": "B. Volk, \r\n K. Weiss",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "06.11.",
        "Time": "16:15-18:00",
        "Where": "HG D 16.2 »",
        "Short Description": "The course “Coaching Students” enhance Student Teaching Assistants (Student TAs) in their role as student coaches to develop basic knowledge about coaching methodology and the mindset of a coach.",
        "ECTS Credits": "1 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0518-00L  \r\n       Introduction to Finite Element Analysis",
        "Lecturers": "D. Kochmann",
        "Comment 1": "Note: The previous course title until FS23 \"Computational Mechanics I: Intro to FEA\"",
        "Comment 2": "N/A",
        "Weekday": "Mo",
        "Time": "10:15-12:00",
        "Where": "ML H 44 »",
        "Short Description": "We discuss numerical methods for solving initial boundary value problems in solid mechanics (static/dynamic elastic problems of solids and structures, thermal problems). Focus is on finite differences and on the finite element method, its theoretical foundation, the choices made when using it, its application for solving problems of engineering interest, and the interpretation of results.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "227-0075-00L  \r\n       Elektrotechnik I",
        "Lecturers": "J. Leuthold",
        "Comment 1": "N/A",
        "Comment 2": "Die Übungen zu \"Elektrotechnik I\" beginnen in der 2. Semesterwoche.Zusätzlich wird das Study Center angeboten: Mittwochs 18:00 - 20:00 Uhr ab der 3. Semesterwoche im HG F 5 wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Fr",
        "Time": "14:15-16:00",
        "Where": "ETA F 5 »",
        "Short Description": "Grundlagenvorlesung im Fachgebiet Elektrotechnik mit folgenden Themen: Konzepte von Spannung und Strom; Analyse von Gleich- und Wechselstromnetzwerken; Serie- und Parallelschaltungen von (komplexen) Widerstandsnetzwerken; Kirchhoff'sche Gesetze und andere Netzwerktheoreme; Transiente Vorgänge; Grundlagen elektrischer und magnetischer Felder;",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "252-0870-00L  \r\n       Stochastics and Machine Learning",
        "Lecturers": "P. Cheridito, \r\n C. Cotrini Jimenez, \r\n A. Streich",
        "Comment 1": "N/A",
        "Comment 2": "Findet am Freitag Nachmittag im HG F 1 mit Videoübertragung ins HG F 3 statt.Zusätzlich wird das Study Center angeboten: Mittwochs 18:15-20:00 ab der 3. Semesterwoche im ETA F 5, wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Do",
        "Time": "09:15-10:00",
        "Where": "ETA F 5 »",
        "Short Description": "This is an introduction to probability, statistics, and machine learning for students of mechanical engineering. We cover the fundamental concepts from probability theory, statistics and machine learning, with a focus on applications for mechanical engineering.",
        "ECTS Credits": "5 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "401-0171-00L  \r\n       Lineare Algebra I",
        "Lecturers": "N. Hungerbühler",
        "Comment 1": "N/A",
        "Comment 2": "Gruppeneinteilung erfolgt über myStudies.Vorlesung im ETA F 5 mit Videoübertragung ins ETF E 1.",
        "Weekday": "Di",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "Die Lineare Algebra ist ein unverzichtbares Werkzeug der Ingenieurmathematik. Die Vorlesung bietet einen Einstieg in die Theorie mit zahlreichen Anwendungen. Die erlernten Begriffe werden in den begleitenden Übungen gefestigt. Die Vorlesung wird als Lineare Algebra II weitergeführt.",
        "ECTS Credits": "6 KP",
        "Restrictions": "Einschränkungen sind unter Gruppen aufgeführt"
    },
    {
        "Course Number and Title": "151-3222-00L  \r\n       Maschinenkonstruktion",
        "Lecturers": "M. Meboldt, \r\n Q. Lohmeyer",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung im HG F 1 mit Videoübertragung ins HG F3.",
        "Weekday": "Di",
        "Time": "10:15-12:00",
        "Where": "HG F 1 »",
        "Short Description": "Die Vorlesung vermittelt die Grundlagen der Entwicklung und Konstruktion technischer Systeme. Für die wichtigsten Maschinenelemente werden Wirkprinzip, Funktionen, Einsatzgebiete und Berechnungsgrundlagen vermittelt. Darauf aufbauend werden anhand von Fallbeispielen aus der Praxis die Grundlagen der Entwicklung, Gestaltung und Fertigung von Produkten behandelt.",
        "ECTS Credits": "5 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-3213-00L  \r\n       Integrative Ski Building Workshop",
        "Lecturers": "K. Shea",
        "Comment 1": "Number of participants limited to 12.- Priority is given to students in the Design, Mechanics and Manufacturing Focus Specialization in the Mechanical Engineering BSc - To apply, please send the following information to jchapuis@ethz.ch by 31.08.2024: Letter of Motivation (one page) , CV, Transcript of Records- Permission from lecturers required for all students.",
        "Comment 2": "Bewilligung der Dozierenden für alle Studierenden notwendig. \r\n  The course takes place on Wednesdays at 14-18h starting in the second week of the semester.",
        "Weekday": "N/A",
        "Time": "N/A",
        "Where": "N/A",
        "Short Description": "This course introduces students to engineering design and fabrication by building their own skis or snowboard. Theoretical and applied engineering design skills like CAD, analysis and engineering of mechanical properties, 3D printing, laser cutting and practical handcrafting skills are acquired in the course.",
        "ECTS Credits": "4 KP",
        "Restrictions": ": Für Fachstudierende und Hörer/-innen ist eine Spezialbewilligung der Dozierenden notwendigBewilligung der Dozierenden für alle Studierenden notwendig"
    },
    {
        "Course Number and Title": "151-3207-00L  \r\n       Lightweight Structures",
        "Lecturers": "T. Tancogne-Dejean",
        "Comment 1": "Note: the previous course title until HS23 \"Leichtbau\" in German.",
        "Comment 2": "The course starts in the 2nd semester week.",
        "Weekday": "Mo",
        "Time": "14:15-16:00",
        "Where": "HG G 3 »",
        "Short Description": "The elective course Lightweight includes numerical methods for the analysis of the load carrying and failure behavior of lightweight structures, as well as construction methods and design principles for lightweight design.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0364-00L  \r\n       Strukturlabor",
        "Lecturers": "M. Zogg",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Do",
        "Time": "14:15-17:00",
        "Where": "IFW C 31 »",
        "Short Description": "Teams mit 2 - 3 Studenten müssen eine möglichst leichte Struktur, welche den gestellten Anforderungen genügt, entwerfen, dimensionieren und herstellen. Ein Flugzeug-Flügelholm-Prototyp und später ein zweiter verbesserter Holm werden getestet und im Hinblick auf konstruktive und strukturmechanische Aspekte beurteilt.",
        "ECTS Credits": "4 KP",
        "Restrictions": "Maximal 26"
    },
    {
        "Course Number and Title": "151-0221-00L  \r\n       Introduction to Modeling and Optimization of Sustainable Energy Systems",
        "Lecturers": "G. Sansavini, \r\n A. Bardow, \r\n S. Moret",
        "Comment 1": "N/A",
        "Comment 2": "N/A",
        "Weekday": "Mi",
        "Time": "16:15-18:00",
        "Where": "HG E 7 »",
        "Short Description": "This course introduces the fundamentals of energy system modeling for the analysis and the optimization of the energy system design and operations.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "401-0261-00L  \r\n       Analysis I",
        "Lecturers": "A. Steiger",
        "Comment 1": "N/A",
        "Comment 2": "Montag und Mittwoch im ETA F 5 mit Videoübertragung ins ETF C 1.Freitag im ETA F 5 mit Videoübertragung ins ETF E 1.",
        "Weekday": "Mo/2w",
        "Time": "12:15-14:00",
        "Where": "ETA F 5 »",
        "Short Description": "Differential- und Integralrechnung von Funktionen einer und mehrerer Variablen; Vektoranalysis; gewöhnliche Differentialgleichungen erster und höherer Ordnung, Differentialgleichungssysteme; Potenzreihen. In jedem Teilbereich eine grosse Anzahl von Anwendungsbeispielen aus Mechanik, Physik und anderen Lehrgebieten des Ingenieurstudiums.",
        "ECTS Credits": "7 KP",
        "Restrictions": "Einschränkungen sind unter Gruppen aufgeführt"
    },
    {
        "Course Number and Title": "151-0503-00L  \r\n       Mechanics III",
        "Lecturers": "D. Kochmann",
        "Comment 1": "N/A",
        "Comment 2": "The Monday lectures are held in HG F 7 with video transmission to HG F 5 (except on Monday 16.10.2023 at 16:15-18:00 in HG E 7 with video transmission to HG E 5)The Wednesday lectures are held in ML D 28 (ETH Zentrum at 14:15 - 16:00) with video transmission to HCI G 7  (ETH Hönggerberg at 14:15 - 16:00). The lectures will start on Wednesday 20.09.2023.",
        "Weekday": "Mo",
        "Time": "14:15-16:00",
        "Where": "HG F 5 »",
        "Short Description": "Dynamics of particles, rigid bodies, and deformable bodies: Motion of a single particle, motion of systems of particles, 2D and 3D motion of rigid bodies, vibrations, waves.",
        "ECTS Credits": "6 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0501-03L  \r\n       Mechanik I",
        "Lecturers": "R. Hopf, \r\n E. Mazza",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung: Mo und Di im ETA F 5 mit Videoübertragung ins ETF E 1In der ersten Semesterwoche fällt das Kolloquium aus und wird durch eine Doppelstunde Vorlesung Di 14-16 ersetzt.",
        "Weekday": "Mo",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "Grundlagen: Lage eines materiellen Punktes; Geschwindigkeit; Kinematik starrer Körper; Kräfte, Reaktionsprinzip; LeistungStatik: Kräftegruppen und Momente; Prinzip der virtuellen Leistungen, Ruhelage und Gleichgewicht, Hauptsatz der Statik; Lagerbindungen und Lagerkräfte; Parallele Kräfte und Schwerpunkt; Statik der Systeme; Fachwerke; Reibung; Seilstatik; Beanspruchung in Stabträgern.",
        "ECTS Credits": "6 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "252-0832-00L  \r\n       Informatik I",
        "Lecturers": "M. Fischer, \r\n R. Sasse",
        "Comment 1": "N/A",
        "Comment 2": "Die Übungen beginnen in der zweiten Semesterwoche.Zusätzlich wird das Study Center angeboten: Mittwochs 18-20 ab der 3. Semesterwoche im HG F 1, wo die Möglichkeit des betreuten Lernens angeboten wird. Im Study Center können Studierende Vorlesungsstoff vor- oder nachbereiten und Übungen lösen.",
        "Weekday": "Mi",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "Die Vorlesung bietet eine Einführung in das Programmieren mit einem Fokus auf systematischem algorithmischem Problemlösen. Lehrsprache ist C++. Es wird keine Programmiererfahrung vorausgesetzt.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0502-00L  \r\n       Mechanik II",
        "Lecturers": "D. Mohr",
        "Comment 1": "N/A",
        "Comment 2": "Vorlesung Mo 10-12 und Mi 10-12 im ETA F 5 mit Videoübertragung ins ETF E 1.",
        "Weekday": "Mo",
        "Time": "10:15-12:00",
        "Where": "ETA F 5 »",
        "Short Description": "Spannungstensor, Verzerrungen, linearelastische Körper, spezielle Biegung prismatischer Balken, numerische Methoden, allgemeinere Biegeprobleme, Torsion, Arbeit und Deformationsenergie, Energiesätze und -verfahren, Knickung.",
        "ECTS Credits": "6 KP",
        "Restrictions": "N/A"
    },
    {
        "Course Number and Title": "151-0973-00L  \r\n       Einführung in die Verfahrenstechnik",
        "Lecturers": "F. Donat, \r\n C. Müller",
        "Comment 1": "N/A",
        "Comment 2": "Die Lehrveranstaltung beginnt in der zweiten Semesterwoche.",
        "Weekday": "Mo",
        "Time": "10:15-12:00",
        "Where": "ML H 44 »",
        "Short Description": "Übersicht über die Verfahrenstechnik; Grundlagen und Aufgabenbereiche der Verfahrenstechnik; Prozessführung und Bilanzierung; Übersicht thermischer Trennverfahren und Mehrphasensystemen; Übersicht mechanischer Trennverfahren und granularer Systeme; Einführung in die Reaktionstechnik, Reaktoren und Verweilzeiten.",
        "ECTS Credits": "4 KP",
        "Restrictions": "N/A"
    }
]